       IDENTIFICATION DIVISION.
       PROGRAM-ID. DOUBLE-NUM.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-INPUT PIC 9(4).
       01 LK-RESULT PIC 9(5).
       PROCEDURE DIVISION USING LK-INPUT LK-RESULT.
       0000-DOUBLE.
           COMPUTE LK-RESULT = LK-INPUT * 2
           GOBACK.
