       IDENTIFICATION DIVISION.
       PROGRAM-ID. L15.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-INPUT PIC 9(4) VALUE 7.
       01 WS-RESULT PIC 9(5) VALUE ZERO.
       PROCEDURE DIVISION.
       0000-MAIN.
           CALL "DOUBLE-NUM" USING WS-INPUT WS-RESULT
           DISPLAY "INPUT=" WS-INPUT
           DISPLAY "RESULT=" WS-RESULT
           STOP RUN.
