       IDENTIFICATION DIVISION.
       PROGRAM-ID. L25.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-RECORD PIC X(120).
       01 WS-COUNT PIC 9(5) VALUE ZERO.
       01 WS-EOF PIC X VALUE "N".
       PROCEDURE DIVISION.
       0000-MAIN.
           DISPLAY "See README."
           STOP RUN.
