       01 TRANSACTION-RECORD.
          05 TX-ACCOUNT-ID PIC X(10).
          05 TRANSACTION-ID PIC X(16).
          05 TRANSACTION-DATE PIC X(8).
          05 TRANSACTION-SEQUENCE PIC X(6).
          05 TRANSACTION-DIRECTION PIC X.
          05 TRANSACTION-AMOUNT PIC X(13).
          05 TRANSACTION-STATUS PIC X.
