       IDENTIFICATION DIVISION.
       PROGRAM-ID. L27.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       0000-MAIN.
           DISPLAY "See README."
           STOP RUN.
