       IDENTIFICATION DIVISION.
       PROGRAM-ID. L03.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       0000-MAIN.
           DISPLAY "COBOL names often use hyphens."
           DISPLAY 2026
           DISPLAY "A period ends a sentence."
           STOP RUN.
