       IDENTIFICATION DIVISION.
       PROGRAM-ID. L19.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       0000-MAIN.
           DISPLAY "A COBOL application is more than one source file."
           DISPLAY "See README."
           STOP RUN.
