       IDENTIFICATION DIVISION.
       PROGRAM-ID. L08.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SCORE PIC 9(3) VALUE 82.
       01 WS-GRADE PIC X VALUE SPACE.
       PROCEDURE DIVISION.
       0000-MAIN.
           EVALUATE TRUE
               WHEN WS-SCORE >= 90 MOVE "A" TO WS-GRADE
               WHEN WS-SCORE >= 80 MOVE "B" TO WS-GRADE
               WHEN OTHER MOVE "C" TO WS-GRADE
           END-EVALUATE
           DISPLAY "GRADE=" WS-GRADE
           STOP RUN.
